Revit 2027 API
View.GetCropRegionShapeManager Method
 Returns an object for managing view crop region shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewCropRegionShapeManager GetCropRegionShapeManager()
Public Function GetCropRegionShapeManager As ViewCropRegionShapeManager
public:
ViewCropRegionShapeManager^ GetCropRegionShapeManager()
member GetCropRegionShapeManager : unit -> ViewCropRegionShapeManager
Return Value
ViewCropRegionShapeManager
 The crop region shape manager.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace